ConfigFiles/InformationRegisters/ВыполнениеОбщихЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВыполнениеОбщихЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПланированияОбщихЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииПроекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СборкаВерсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СборкиВерсии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТехническийПроект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехническиеПроекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Библиотека</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбщихЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПубликуемыйСрокВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбщаяЗадача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщиеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/Enums/СтатусыОбщихЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыОбщихЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяЗапланировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/ВариантыПланированияОбщихЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыПланированияОбщихЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Версия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническийПроект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользованиеБиблиотеки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Catalogs/ВерсииПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВерсииПроекта</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Проекты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияМеханизмаОбновленияИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПлатформыХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ветка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВключенияБиблиотек</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГотовностиКПредварительномуВстраиванию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВнешнегоТестирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРазработки</Name>
					<Comment>Начало разработки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияРазработки</Name>
					<Comment>Окончание разработки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПредстоящейСборки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращенияПоддержки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяИБДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяХранилищаДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогИБДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПодредакции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРедакции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьКонфигурациюИзХранилищаПриЗагрузкеМетаданных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяИБДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяХранилищаДляЗагрузкиМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубликуемыйНомерВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьПатчи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВерсииВключаемыхПроектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВерсииПроекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтличияВИменахМетаданных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтличияВСоставеПодсистем</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подсистема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подсистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектНужноДобавитьВПодсистему</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/InformationRegisters/ВыполнениеОбщихЗадач/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Запись.ИсходныйКлючЗаписи.Пустой() Тогда
	    ПричтенииСозданииНаСервере();
	КонецЕсли;

	УстановитьВидимостьЭлементовПланирования();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьВидимостьЭлементовПланирования();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если Запись.СтатусВыполнения = Перечисления.СтатусыОбщихЗадач.ТребуетсяЗапланировать
		ИЛИ Запись.СтатусВыполнения = Перечисления.СтатусыОбщихЗадач.Отменена Тогда
		
		НепроверяемыеРеквизиты.Добавить("ВариантПланирования");
		НепроверяемыеРеквизиты.Добавить("Версия");
		НепроверяемыеРеквизиты.Добавить("ТехническийПроект");
		НепроверяемыеРеквизиты.Добавить("Библиотека");
		
	КонецЕсли;
	
	Если Запись.ВариантПланирования = Перечисления.ВариантыПланированияОбщихЗадач.Версия Тогда
		НепроверяемыеРеквизиты.Добавить("ТехническийПроект");
		НепроверяемыеРеквизиты.Добавить("Библиотека");
	ИначеЕсли Запись.ВариантПланирования = Перечисления.ВариантыПланированияОбщихЗадач.ТехническийПроект Тогда
		НепроверяемыеРеквизиты.Добавить("Версия");
		НепроверяемыеРеквизиты.Добавить("Библиотека");
	ИначеЕсли Запись.ВариантПланирования = Перечисления.ВариантыПланированияОбщихЗадач.ИспользованиеБиблиотеки Тогда
		НепроверяемыеРеквизиты.Добавить("ТехническийПроект");
	КонецЕсли;
	
	Если Запись.СтатусВыполнения <> Перечисления.СтатусыОбщихЗадач.Выполнена
		ИЛИ ЗначениеЗаполнено(Запись.СборкаВерсии) Тогда
		НепроверяемыеРеквизиты.Добавить("СборкаВерсии");
	КонецЕсли;
	
	Если НепроверяемыеРеквизиты.Количество()>0 Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	КонецЕсли;
	
	Если Запись.СтатусВыполнения = Перечисления.СтатусыОбщихЗадач.Запланирована
		ИЛИ Запись.СтатусВыполнения = Перечисления.СтатусыОбщихЗадач.Выполнена Тогда
		
		Если Запись.ВариантПланирования = Перечисления.ВариантыПланированияОбщихЗадач.Версия
			И НЕ ЗначениеЗаполнено(Запись.Версия) Тогда
			
			Отказ = Истина;
			ТекстСообщения = НСтр("ru='Поле ""Версия"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Версия", "Запись", Отказ);
			
		ИначеЕсли Запись.ВариантПланирования = Перечисления.ВариантыПланированияОбщихЗадач.ТехническийПроект
			И НЕ ЗначениеЗаполнено(Запись.ТехническийПроект) Тогда
			
			Отказ = Истина;
			ТекстСообщения = НСтр("ru='Поле ""Технический проект"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ТехническийПроект", "Запись", Отказ);
			
		ИначеЕсли Запись.ВариантПланирования = Перечисления.ВариантыПланированияОбщихЗадач.ИспользованиеБиблиотеки Тогда
			
			Если НЕ ЗначениеЗаполнено(Запись.Версия) Тогда
				Отказ = Истина;
				ТекстСообщения = НСтр("ru='Поле ""Версия"" не заполнено'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Версия", "Запись", Отказ);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Запись.Библиотека) Тогда
				Отказ = Истина;
				ТекстСообщения = НСтр("ru='Поле ""Библиотека"" не заполнено'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Библиотека", "Запись", Отказ);
			КонецЕсли;
		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Запись.СрокВыполнения) Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru='Поле ""Срок выполнения"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "СрокВыполнения", "Запись", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Запись.СтатусВыполнения = Перечисления.СтатусыОбщихЗадач.Выполнена
		И НЕ ЗначениеЗаполнено(Запись.СборкаВерсии) Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru='Поле ""Сборка"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "СборкаВерсии", "Запись", Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЕстьИзменения = Ложь;
	
	Если НЕ Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ОбщаяЗадача", Запись.ИсходныйКлючЗаписи.ОбщаяЗадача);
		СтруктураОтбора.Вставить("Проект", Запись.ИсходныйКлючЗаписи.Проект);
		
		СтруктураДанных = РегистрыСведений.ВыполнениеОбщихЗадач.ПолучитьПоследнее(, СтруктураОтбора);
		
		Если Запись.ИсходныйКлючЗаписи.ОбщаяЗадача <> ТекущийОбъект.ОбщаяЗадача
			ИЛИ Запись.ИсходныйКлючЗаписи.Проект <> ТекущийОбъект.Проект
			ИЛИ СтруктураДанных.Ответственный <> ТекущийОбъект.Ответственный
			ИЛИ СтруктураДанных.ВариантПланирования <> ТекущийОбъект.ВариантПланирования
			ИЛИ СтруктураДанных.ТехническийПроект <> ТекущийОбъект.ТехническийПроект
			ИЛИ СтруктураДанных.Версия <> ТекущийОбъект.Версия
			ИЛИ СтруктураДанных.Библиотека <> ТекущийОбъект.Библиотека
			ИЛИ СтруктураДанных.СтатусВыполнения <> ТекущийОбъект.СтатусВыполнения
			ИЛИ СтруктураДанных.СрокВыполнения <> ТекущийОбъект.СрокВыполнения
			ИЛИ СтруктураДанных.ПубликуемыйСрокВыполнения <> ТекущийОбъект.ПубликуемыйСрокВыполнения
			ИЛИ СтруктураДанных.Ответственный <> ТекущийОбъект.Ответственный
			ИЛИ СтруктураДанных.Комментарий <> ТекущийОбъект.Комментарий Тогда
			
			ТекущийОбъект.Пользователь = Пользователи.ТекущийПользователь();
			
			ЕстьИзменения = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьИзменения Тогда
		ТекущийОбъект.Период = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантПланированияПриИзменении(Элемент)
	
	ПриИзмененииВариантаПланированияСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	УстановитьНадписьПоРазличиюВерсий();
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПриИзменении(Элемент)
	
	УстановитьНадписьПоРазличиюВерсий();
	
КонецПроцедуры

&НаКлиенте
Процедура ТехническийПроектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораТехническогоПроекта = Новый Структура;
	ПараметрыВыбораТехническогоПроекта.Вставить("Версия", "Указанная");
	ПараметрыВыбораТехническогоПроекта.Вставить("ВерсияДляОтбора", Запись.Версия);
	ПараметрыВыбораТехническогоПроекта.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.ТехническиеПроекты.Форма.ФормаВыбора", ПараметрыВыбораТехническогоПроекта, Элементы.ТехническийПроект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТехническийПроектПриИзменении(Элемент)
	
	УстановитьНадписьПоРазличиюВерсий();
	
КонецПроцедуры

&НаКлиенте
Процедура БиблиотекаПриИзменении(Элемент)
	
	ПриИзмененииБиблиотекиСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииВариантаПланированияСервер()

	ОпределитьВерсиюБиблиотекиИСтатусВыполнения();
	УстановитьВидимостьЭлементовПланирования();
	УстановитьНадписьПоРазличиюВерсий();
	УстановитьВидимостьЗаголовокКомментарияКВерсииБиблиотеки();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииБиблиотекиСервер()
	
	ОпределитьВерсиюБиблиотекиИСтатусВыполнения();
	УстановитьВидимостьЗаголовокКомментарияКВерсииБиблиотеки();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовПланирования()
	
	Если Запись.ВариантПланирования = Перечисления.ВариантыПланированияОбщихЗадач.ТехническийПроект Тогда
		Элементы.Библиотека.Видимость = Ложь;
		Элементы.ТехническийПроект.Видимость = Истина;
		Элементы.ТехническийПроектВерсия.Видимость = Истина;
	ИначеЕсли Запись.ВариантПланирования = Перечисления.ВариантыПланированияОбщихЗадач.ИспользованиеБиблиотеки Тогда
		Элементы.Библиотека.Видимость = Истина;
		Элементы.ТехническийПроект.Видимость = Ложь;
		Элементы.ТехническийПроектВерсия.Видимость = Ложь;
	Иначе
		Элементы.Библиотека.Видимость = Ложь;
		Элементы.ТехническийПроект.Видимость = Ложь;
		Элементы.ТехническийПроектВерсия.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЗаголовокКомментарияКВерсииБиблиотеки()
	
	Если Запись.ВариантПланирования = Перечисления.ВариантыПланированияОбщихЗадач.ИспользованиеБиблиотеки
		И ЗначениеЗаполнено(Запись.Библиотека) Тогда
		КомментарийДоступен = Истина;
	Иначе
		Элементы.КомментарийВерсияБиблиотеки.Заголовок = "";
		КомментарийДоступен = Ложь;
	КонецЕсли;
	
	Элементы.КомментарийВерсияБиблиотеки.Видимость = КомментарийДоступен;
	Элементы.ВерсияБиблиотеки.Видимость = КомментарийДоступен И ЗначениеЗаполнено(ВерсияБиблиотеки);
	Элементы.ВерсияБиблиотекиПлановаяДатаВыпуска.Видимость = КомментарийДоступен И ЗначениеЗаполнено(ВерсияБиблиотеки);
	
	Если КомментарийДоступен Тогда
		
		Если ЗначениеЗаполнено(ВерсияБиблиотеки) Тогда
			Если СтатусЗадачиВБиблиотеке = Перечисления.СтатусыОбщихЗадач.Запланирована Тогда
				ТекстЗаголовка = НСтр("ru='Задача запланирована в библиотеке к версии'");
			ИначеЕсли СтатусЗадачиВБиблиотеке = Перечисления.СтатусыОбщихЗадач.Выполнена Тогда
				ТекстЗаголовка = НСтр("ru='Задача выполнена в библиотеке в версии'");
			Иначе
				ТекстЗаголовка = НСтр("ru='Задача не запланирована в библиотеке'");
			КонецЕсли;
		Иначе
			ТекстЗаголовка = НСтр("ru='Задача не запланирована в библиотеке'");
		КонецЕсли;
		
		Элементы.КомментарийВерсияБиблиотеки.Заголовок = ТекстЗаголовка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ОпределитьВерсиюБиблиотекиИСтатусВыполнения();
	УстановитьВидимостьЗаголовокКомментарияКВерсииБиблиотеки();
	УстановитьНадписьПоРазличиюВерсий();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНадписьПоРазличиюВерсий()
	
	ЕстьРазличия = Ложь;
	
	Если Запись.ВариантПланирования = Перечисления.ВариантыПланированияОбщихЗадач.ТехническийПроект
		И ЗначениеЗаполнено(Запись.ТехническийПроект)
		И ЗначениеЗаполнено(Запись.Версия) Тогда
		
		ВерсияТехническогоПроекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ТехническийПроект, "Версия");
		
		Если ВерсияТехническогоПроекта <> Запись.Версия Тогда
			ЕстьРазличия = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьРазличия Тогда
		Элементы.КомментарийПоРазличиямВерсий.Заголовок = НСтр("ru='Указанная версия и версия технического проекта различаются'");
		Элементы.КомментарийПоРазличиямВерсий.Видимость = Истина;
	Иначе
		Элементы.КомментарийПоРазличиямВерсий.Заголовок = "";
		Элементы.КомментарийПоРазличиямВерсий.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьВерсиюБиблиотекиИСтатусВыполнения()
	
	Если Запись.ВариантПланирования <> Перечисления.ВариантыПланированияОбщихЗадач.ИспользованиеБиблиотеки Тогда
		ВерсияБиблиотеки = Справочники.ВерсииПроекта.ПустаяСсылка();
		СтатусЗадачиВБиблиотеке = Перечисления.СтатусыОбщихЗадач.ПустаяСсылка();
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВыполнениеОбщихЗадачСрезПоследних.Версия КАК Версия,
	|	ВыполнениеОбщихЗадачСрезПоследних.статусВыполнения КАК Статус
	|ИЗ
	|	РегистрСведений.ВыполнениеОбщихЗадач.СрезПоследних(
	|			,
	|			ОбщаяЗадача = &ОбщаяЗадача
	|				И Проект = &Библиотека) КАК ВыполнениеОбщихЗадачСрезПоследних"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОбщаяЗадача", Запись.ОбщаяЗадача);
	Запрос.УстановитьПараметр("Библиотека", Запись.Библиотека);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ВерсияБиблиотеки = Выборка.Версия;
		СтатусЗадачиВБиблиотеке = Выборка.Статус;
	Иначе
		ВерсияБиблиотеки = Справочники.ВерсииПроекта.ПустаяСсылка();
		СтатусЗадачиВБиблиотеке = Перечисления.СтатусыОбщихЗадач.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
